zhengwang721/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20128g3.h
/**
 * \file
 *
 * Copyright (c) 2012 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20128G3_PIO_
#define _SAMD20128G3_PIO_

#define PIN_PA00                           0  /**< \brief Pin Number for PA00 */
#define PORT_PA00                  (1u <<  0) /**< \brief PORT Mask  for PA00 */
#define PIN_PA01                           1  /**< \brief Pin Number for PA01 */
#define PORT_PA01                  (1u <<  1) /**< \brief PORT Mask  for PA01 */
#define PIN_PA02                           2  /**< \brief Pin Number for PA02 */
#define PORT_PA02                  (1u <<  2) /**< \brief PORT Mask  for PA02 */
#define PIN_PA03                           3  /**< \brief Pin Number for PA03 */
#define PORT_PA03                  (1u <<  3) /**< \brief PORT Mask  for PA03 */
#define PIN_PA04                           4  /**< \brief Pin Number for PA04 */
#define PORT_PA04                  (1u <<  4) /**< \brief PORT Mask  for PA04 */
#define PIN_PA05                           5  /**< \brief Pin Number for PA05 */
#define PORT_PA05                  (1u <<  5) /**< \brief PORT Mask  for PA05 */
#define PIN_PA06                           6  /**< \brief Pin Number for PA06 */
#define PORT_PA06                  (1u <<  6) /**< \brief PORT Mask  for PA06 */
#define PIN_PA07                           7  /**< \brief Pin Number for PA07 */
#define PORT_PA07                  (1u <<  7) /**< \brief PORT Mask  for PA07 */
#define PIN_PA08                           8  /**< \brief Pin Number for PA08 */
#define PORT_PA08                  (1u <<  8) /**< \brief PORT Mask  for PA08 */
#define PIN_PA09                           9  /**< \brief Pin Number for PA09 */
#define PORT_PA09                  (1u <<  9) /**< \brief PORT Mask  for PA09 */
#define PIN_PA10                          10  /**< \brief Pin Number for PA10 */
#define PORT_PA10                  (1u << 10) /**< \brief PORT Mask  for PA10 */
#define PIN_PA11                          11  /**< \brief Pin Number for PA11 */
#define PORT_PA11                  (1u << 11) /**< \brief PORT Mask  for PA11 */
#define PIN_PA12                          12  /**< \brief Pin Number for PA12 */
#define PORT_PA12                  (1u << 12) /**< \brief PORT Mask  for PA12 */
#define PIN_PA13                          13  /**< \brief Pin Number for PA13 */
#define PORT_PA13                  (1u << 13) /**< \brief PORT Mask  for PA13 */
#define PIN_PA14                          14  /**< \brief Pin Number for PA14 */
#define PORT_PA14                  (1u << 14) /**< \brief PORT Mask  for PA14 */
#define PIN_PA15                          15  /**< \brief Pin Number for PA15 */
#define PORT_PA15                  (1u << 15) /**< \brief PORT Mask  for PA15 */
#define PIN_PA16                          16  /**< \brief Pin Number for PA16 */
#define PORT_PA16                  (1u << 16) /**< \brief PORT Mask  for PA16 */
#define PIN_PA17                          17  /**< \brief Pin Number for PA17 */
#define PORT_PA17                  (1u << 17) /**< \brief PORT Mask  for PA17 */
#define PIN_PA18                          18  /**< \brief Pin Number for PA18 */
#define PORT_PA18                  (1u << 18) /**< \brief PORT Mask  for PA18 */
#define PIN_PA19                          19  /**< \brief Pin Number for PA19 */
#define PORT_PA19                  (1u << 19) /**< \brief PORT Mask  for PA19 */
#define PIN_PA24                          24  /**< \brief Pin Number for PA24 */
#define PORT_PA24                  (1u << 24) /**< \brief PORT Mask  for PA24 */
#define PIN_PA25                          25  /**< \brief Pin Number for PA25 */
#define PORT_PA25                  (1u << 25) /**< \brief PORT Mask  for PA25 */
#define PIN_PA26                          26  /**< \brief Pin Number for PA26 */
#define PORT_PA26                  (1u << 26) /**< \brief PORT Mask  for PA26 */
#define PIN_PA27                          27  /**< \brief Pin Number for PA27 */
#define PORT_PA27                  (1u << 27) /**< \brief PORT Mask  for PA27 */
#define PIN_PA28                          28  /**< \brief Pin Number for PA28 */
#define PORT_PA28                  (1u << 28) /**< \brief PORT Mask  for PA28 */
#define PIN_PA29                          29  /**< \brief Pin Number for PA29 */
#define PORT_PA29                  (1u << 29) /**< \brief PORT Mask  for PA29 */
#define PIN_PA30                          30  /**< \brief Pin Number for PA30 */
#define PORT_PA30                  (1u << 30) /**< \brief PORT Mask  for PA30 */
#define PIN_PA31                          31  /**< \brief Pin Number for PA31 */
#define PORT_PA31                  (1u << 31) /**< \brief PORT Mask  for PA31 */
#define PIN_PB00                          32  /**< \brief Pin Number for PB00 */
#define PORT_PB00                  (1u <<  0) /**< \brief PORT Mask  for PB00 */
#define PIN_PB01                          33  /**< \brief Pin Number for PB01 */
#define PORT_PB01                  (1u <<  1) /**< \brief PORT Mask  for PB01 */
#define PIN_PB02                          34  /**< \brief Pin Number for PB02 */
#define PORT_PB02                  (1u <<  2) /**< \brief PORT Mask  for PB02 */
#define PIN_PB03                          35  /**< \brief Pin Number for PB03 */
#define PORT_PB03                  (1u <<  3) /**< \brief PORT Mask  for PB03 */
#define PIN_PB08                          40  /**< \brief Pin Number for PB08 */
#define PORT_PB08                  (1u <<  8) /**< \brief PORT Mask  for PB08 */
#define PIN_PB09                          41  /**< \brief Pin Number for PB09 */
#define PORT_PB09                  (1u <<  9) /**< \brief PORT Mask  for PB09 */
#define PIN_PB20                          52  /**< \brief Pin Number for PB20 */
#define PORT_PB20                  (1u << 20) /**< \brief PORT Mask  for PB20 */
#define PIN_PB21                          53  /**< \brief Pin Number for PB21 */
#define PORT_PB21                  (1u << 21) /**< \brief PORT Mask  for PB21 */
#define PIN_PB22                          54  /**< \brief Pin Number for PB22 */
#define PORT_PB22                  (1u << 22) /**< \brief PORT Mask  for PB22 */
#define PIN_PB23                          55  /**< \brief Pin Number for PB23 */
#define PORT_PB23                  (1u << 23) /**< \brief PORT Mask  for PB23 */
/* ========== PORT definition for CORE peripheral ========== */
#define PIN_PA28F_CORE_SWCLK              28  /**< \brief CORE signal: SWCLK on PA28 mux F */
#define MUX_PA28F_CORE_SWCLK               5
#define PORT_PA28F_CORE_SWCLK      (1u << 28)
/* ========== PORT definition for GCLK peripheral ========== */
#define PIN_PA16G_GCLK_IO0                16  /**< \brief GCLK signal: IO0 on PA16 mux G */
#define MUX_PA16G_GCLK_IO0                 6
#define PORT_PA16G_GCLK_IO0        (1u << 16)
#define PIN_PA28G_GCLK_IO0                28  /**< \brief GCLK signal: IO0 on PA28 mux G */
#define MUX_PA28G_GCLK_IO0                 6
#define PORT_PA28G_GCLK_IO0        (1u << 28)
#define PIN_PA31G_GCLK_IO0                31  /**< \brief GCLK signal: IO0 on PA31 mux G */
#define MUX_PA31G_GCLK_IO0                 6
#define PORT_PA31G_GCLK_IO0        (1u << 31)
#define PIN_PB20G_GCLK_IO0                52  /**< \brief GCLK signal: IO0 on PB20 mux G */
#define MUX_PB20G_GCLK_IO0                 6
#define PORT_PB20G_GCLK_IO0        (1u << 20)
#define PIN_PA17G_GCLK_IO1                17  /**< \brief GCLK signal: IO1 on PA17 mux G */
#define MUX_PA17G_GCLK_IO1                 6
#define PORT_PA17G_GCLK_IO1        (1u << 17)
#define PIN_PB21G_GCLK_IO1                53  /**< \brief GCLK signal: IO1 on PB21 mux G */
#define MUX_PB21G_GCLK_IO1                 6
#define PORT_PB21G_GCLK_IO1        (1u << 21)
#define PIN_PA18G_GCLK_IO2                18  /**< \brief GCLK signal: IO2 on PA18 mux G */
#define MUX_PA18G_GCLK_IO2                 6
#define PORT_PA18G_GCLK_IO2        (1u << 18)
#define PIN_PB22G_GCLK_IO2                54  /**< \brief GCLK signal: IO2 on PB22 mux G */
#define MUX_PB22G_GCLK_IO2                 6
#define PORT_PB22G_GCLK_IO2        (1u << 22)
#define PIN_PA19G_GCLK_IO3                19  /**< \brief GCLK signal: IO3 on PA19 mux G */
#define MUX_PA19G_GCLK_IO3                 6
#define PORT_PA19G_GCLK_IO3        (1u << 19)
#define PIN_PB23G_GCLK_IO3                55  /**< \brief GCLK signal: IO3 on PB23 mux G */
#define MUX_PB23G_GCLK_IO3                 6
#define PORT_PB23G_GCLK_IO3        (1u << 23)
#define PIN_PA24G_GCLK_IO4                24  /**< \brief GCLK signal: IO4 on PA24 mux G */
#define MUX_PA24G_GCLK_IO4                 6
#define PORT_PA24G_GCLK_IO4        (1u << 24)
#define PIN_PA25G_GCLK_IO5                25  /**< \brief GCLK signal: IO5 on PA25 mux G */
#define MUX_PA25G_GCLK_IO5                 6
#define PORT_PA25G_GCLK_IO5        (1u << 25)
#define PIN_PA26G_GCLK_IO6                26  /**< \brief GCLK signal: IO6 on PA26 mux G */
#define MUX_PA26G_GCLK_IO6                 6
#define PORT_PA26G_GCLK_IO6        (1u << 26)
#define PIN_PA27G_GCLK_IO7                27  /**< \brief GCLK signal: IO7 on PA27 mux G */
#define MUX_PA27G_GCLK_IO7                 6
#define PORT_PA27G_GCLK_IO7        (1u << 27)
/* ========== PORT definition for EIC peripheral ========== */
#define PIN_PA00A_EIC_EXTINT0              0  /**< \brief EIC signal: EXTINT0 on PA00 mux A */
#define MUX_PA00A_EIC_EXTINT0              0
#define PORT_PA00A_EIC_EXTINT0     (1u <<  0)
#define PIN_PB00A_EIC_EXTINT0             32  /**< \brief EIC signal: EXTINT0 on PB00 mux A */
#define MUX_PB00A_EIC_EXTINT0              0
#define PORT_PB00A_EIC_EXTINT0     (1u <<  0)
#define PIN_PB20A_EIC_EXTINT0             52  /**< \brief EIC signal: EXTINT0 on PB20 mux A */
#define MUX_PB20A_EIC_EXTINT0              0
#define PORT_PB20A_EIC_EXTINT0     (1u << 20)
#define PIN_PA01A_EIC_EXTINT1              1  /**< \brief EIC signal: EXTINT1 on PA01 mux A */
#define MUX_PA01A_EIC_EXTINT1              0
#define PORT_PA01A_EIC_EXTINT1     (1u <<  1)
#define PIN_PB01A_EIC_EXTINT1             33  /**< \brief EIC signal: EXTINT1 on PB01 mux A */
#define MUX_PB01A_EIC_EXTINT1              0
#define PORT_PB01A_EIC_EXTINT1     (1u <<  1)
#define PIN_PB21A_EIC_EXTINT1             53  /**< \brief EIC signal: EXTINT1 on PB21 mux A */
#define MUX_PB21A_EIC_EXTINT1              0
#define PORT_PB21A_EIC_EXTINT1     (1u << 21)
#define PIN_PA04A_EIC_EXTINT2              4  /**< \brief EIC signal: EXTINT2 on PA04 mux A */
#define MUX_PA04A_EIC_EXTINT2              0
#define PORT_PA04A_EIC_EXTINT2     (1u <<  4)
#define PIN_PB22A_EIC_EXTINT2             54  /**< \brief EIC signal: EXTINT2 on PB22 mux A */
#define MUX_PB22A_EIC_EXTINT2              0
#define PORT_PB22A_EIC_EXTINT2     (1u << 22)
#define PIN_PA05A_EIC_EXTINT3              5  /**< \brief EIC signal: EXTINT3 on PA05 mux A */
#define MUX_PA05A_EIC_EXTINT3              0
#define PORT_PA05A_EIC_EXTINT3     (1u <<  5)
#define PIN_PB23A_EIC_EXTINT3             55  /**< \brief EIC signal: EXTINT3 on PB23 mux A */
#define MUX_PB23A_EIC_EXTINT3              0
#define PORT_PB23A_EIC_EXTINT3     (1u << 23)
#define PIN_PA08A_EIC_EXTINT4              8  /**< \brief EIC signal: EXTINT4 on PA08 mux A */
#define MUX_PA08A_EIC_EXTINT4              0
#define PORT_PA08A_EIC_EXTINT4     (1u <<  8)
#define PIN_PA28A_EIC_EXTINT4             28  /**< \brief EIC signal: EXTINT4 on PA28 mux A */
#define MUX_PA28A_EIC_EXTINT4              0
#define PORT_PA28A_EIC_EXTINT4     (1u << 28)
#define PIN_PB08A_EIC_EXTINT4             40  /**< \brief EIC signal: EXTINT4 on PB08 mux A */
#define MUX_PB08A_EIC_EXTINT4              0
#define PORT_PB08A_EIC_EXTINT4     (1u <<  8)
#define PIN_PA09A_EIC_EXTINT5              9  /**< \brief EIC signal: EXTINT5 on PA09 mux A */
#define MUX_PA09A_EIC_EXTINT5              0
#define PORT_PA09A_EIC_EXTINT5     (1u <<  9)
#define PIN_PA29A_EIC_EXTINT5             29  /**< \brief EIC signal: EXTINT5 on PA29 mux A */
#define MUX_PA29A_EIC_EXTINT5              0
#define PORT_PA29A_EIC_EXTINT5     (1u << 29)
#define PIN_PB09A_EIC_EXTINT5             41  /**< \brief EIC signal: EXTINT5 on PB09 mux A */
#define MUX_PB09A_EIC_EXTINT5              0
#define PORT_PB09A_EIC_EXTINT5     (1u <<  9)
#define PIN_PA10A_EIC_EXTINT6             10  /**< \brief EIC signal: EXTINT6 on PA10 mux A */
#define MUX_PA10A_EIC_EXTINT6              0
#define PORT_PA10A_EIC_EXTINT6     (1u << 10)
#define PIN_PA11A_EIC_EXTINT7             11  /**< \brief EIC signal: EXTINT7 on PA11 mux A */
#define MUX_PA11A_EIC_EXTINT7              0
#define PORT_PA11A_EIC_EXTINT7     (1u << 11)
#define PIN_PA31A_EIC_EXTINT7             31  /**< \brief EIC signal: EXTINT7 on PA31 mux A */
#define MUX_PA31A_EIC_EXTINT7              0
#define PORT_PA31A_EIC_EXTINT7     (1u << 31)
#define PIN_PA02A_EIC_EXTINT8              2  /**< \brief EIC signal: EXTINT8 on PA02 mux A */
#define MUX_PA02A_EIC_EXTINT8              0
#define PORT_PA02A_EIC_EXTINT8     (1u <<  2)
#define PIN_PA16A_EIC_EXTINT8             16  /**< \brief EIC signal: EXTINT8 on PA16 mux A */
#define MUX_PA16A_EIC_EXTINT8              0
#define PORT_PA16A_EIC_EXTINT8     (1u << 16)
#define PIN_PB02A_EIC_EXTINT8             34  /**< \brief EIC signal: EXTINT8 on PB02 mux A */
#define MUX_PB02A_EIC_EXTINT8              0
#define PORT_PB02A_EIC_EXTINT8     (1u <<  2)
#define PIN_PA03A_EIC_EXTINT9              3  /**< \brief EIC signal: EXTINT9 on PA03 mux A */
#define MUX_PA03A_EIC_EXTINT9              0
#define PORT_PA03A_EIC_EXTINT9     (1u <<  3)
#define PIN_PA17A_EIC_EXTINT9             17  /**< \brief EIC signal: EXTINT9 on PA17 mux A */
#define MUX_PA17A_EIC_EXTINT9              0
#define PORT_PA17A_EIC_EXTINT9     (1u << 17)
#define PIN_PB03A_EIC_EXTINT9             35  /**< \brief EIC signal: EXTINT9 on PB03 mux A */
#define MUX_PB03A_EIC_EXTINT9              0
#define PORT_PB03A_EIC_EXTINT9     (1u <<  3)
#define PIN_PA06A_EIC_EXTINT10             6  /**< \brief EIC signal: EXTINT10 on PA06 mux A */
#define MUX_PA06A_EIC_EXTINT10             0
#define PORT_PA06A_EIC_EXTINT10    (1u <<  6)
#define PIN_PA18A_EIC_EXTINT10            18  /**< \brief EIC signal: EXTINT10 on PA18 mux A */
#define MUX_PA18A_EIC_EXTINT10             0
#define PORT_PA18A_EIC_EXTINT10    (1u << 18)
#define PIN_PA07A_EIC_EXTINT11             7  /**< \brief EIC signal: EXTINT11 on PA07 mux A */
#define MUX_PA07A_EIC_EXTINT11             0
#define PORT_PA07A_EIC_EXTINT11    (1u <<  7)
#define PIN_PA19A_EIC_EXTINT11            19  /**< \brief EIC signal: EXTINT11 on PA19 mux A */
#define MUX_PA19A_EIC_EXTINT11             0
#define PORT_PA19A_EIC_EXTINT11    (1u << 19)
#define PIN_PA12A_EIC_EXTINT12            12  /**< \brief EIC signal: EXTINT12 on PA12 mux A */
#define MUX_PA12A_EIC_EXTINT12             0
#define PORT_PA12A_EIC_EXTINT12    (1u << 12)
#define PIN_PA24A_EIC_EXTINT12            24  /**< \brief EIC signal: EXTINT12 on PA24 mux A */
#define MUX_PA24A_EIC_EXTINT12             0
#define PORT_PA24A_EIC_EXTINT12    (1u << 24)
#define PIN_PA13A_EIC_EXTINT13            13  /**< \brief EIC signal: EXTINT13 on PA13 mux A */
#define MUX_PA13A_EIC_EXTINT13             0
#define PORT_PA13A_EIC_EXTINT13    (1u << 13)
#define PIN_PA25A_EIC_EXTINT13            25  /**< \brief EIC signal: EXTINT13 on PA25 mux A */
#define MUX_PA25A_EIC_EXTINT13             0
#define PORT_PA25A_EIC_EXTINT13    (1u << 25)
#define PIN_PA14A_EIC_EXTINT14            14  /**< \brief EIC signal: EXTINT14 on PA14 mux A */
#define MUX_PA14A_EIC_EXTINT14             0
#define PORT_PA14A_EIC_EXTINT14    (1u << 14)
#define PIN_PA26A_EIC_EXTINT14            26  /**< \brief EIC signal: EXTINT14 on PA26 mux A */
#define MUX_PA26A_EIC_EXTINT14             0
#define PORT_PA26A_EIC_EXTINT14    (1u << 26)
#define PIN_PA15A_EIC_EXTINT15            15  /**< \brief EIC signal: EXTINT15 on PA15 mux A */
#define MUX_PA15A_EIC_EXTINT15             0
#define PORT_PA15A_EIC_EXTINT15    (1u << 15)
#define PIN_PA27A_EIC_EXTINT15            27  /**< \brief EIC signal: EXTINT15 on PA27 mux A */
#define MUX_PA27A_EIC_EXTINT15             0
#define PORT_PA27A_EIC_EXTINT15    (1u << 27)
#define PIN_PA30A_EIC_NMI                 30  /**< \brief EIC signal: NMI on PA30 mux A */
#define MUX_PA30A_EIC_NMI                  0
#define PORT_PA30A_EIC_NMI         (1u << 30)
/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PA02C_SERCOM0_PAD0             2  /**< \brief SERCOM0 signal: PAD0 on PA02 mux C */
#define MUX_PA02C_SERCOM0_PAD0             2
#define PORT_PA02C_SERCOM0_PAD0    (1u <<  2)
#define PIN_PA10B_SERCOM0_PAD0            10  /**< \brief SERCOM0 signal: PAD0 on PA10 mux B */
#define MUX_PA10B_SERCOM0_PAD0             1
#define PORT_PA10B_SERCOM0_PAD0    (1u << 10)
#define PIN_PA03C_SERCOM0_PAD1             3  /**< \brief SERCOM0 signal: PAD1 on PA03 mux C */
#define MUX_PA03C_SERCOM0_PAD1             2
#define PORT_PA03C_SERCOM0_PAD1    (1u <<  3)
#define PIN_PA11B_SERCOM0_PAD1            11  /**< \brief SERCOM0 signal: PAD1 on PA11 mux B */
#define MUX_PA11B_SERCOM0_PAD1             1
#define PORT_PA11B_SERCOM0_PAD1    (1u << 11)
#define PIN_PA00C_SERCOM0_PAD2             0  /**< \brief SERCOM0 signal: PAD2 on PA00 mux C */
#define MUX_PA00C_SERCOM0_PAD2             2
#define PORT_PA00C_SERCOM0_PAD2    (1u <<  0)
#define PIN_PA08B_SERCOM0_PAD2             8  /**< \brief SERCOM0 signal: PAD2 on PA08 mux B */
#define MUX_PA08B_SERCOM0_PAD2             1
#define PORT_PA08B_SERCOM0_PAD2    (1u <<  8)
#define PIN_PA01C_SERCOM0_PAD3             1  /**< \brief SERCOM0 signal: PAD3 on PA01 mux C */
#define MUX_PA01C_SERCOM0_PAD3             2
#define PORT_PA01C_SERCOM0_PAD3    (1u <<  1)
#define PIN_PA09B_SERCOM0_PAD3             9  /**< \brief SERCOM0 signal: PAD3 on PA09 mux B */
#define MUX_PA09B_SERCOM0_PAD3             1
#define PORT_PA09B_SERCOM0_PAD3    (1u <<  9)
/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PA30C_SERCOM1_PAD0            30  /**< \brief SERCOM1 signal: PAD0 on PA30 mux C */
#define MUX_PA30C_SERCOM1_PAD0             2
#define PORT_PA30C_SERCOM1_PAD0    (1u << 30)
#define PIN_PA18B_SERCOM1_PAD0            18  /**< \brief SERCOM1 signal: PAD0 on PA18 mux B */
#define MUX_PA18B_SERCOM1_PAD0             1
#define PORT_PA18B_SERCOM1_PAD0    (1u << 18)
#define PIN_PA31C_SERCOM1_PAD1            31  /**< \brief SERCOM1 signal: PAD1 on PA31 mux C */
#define MUX_PA31C_SERCOM1_PAD1             2
#define PORT_PA31C_SERCOM1_PAD1    (1u << 31)
#define PIN_PA19B_SERCOM1_PAD1            19  /**< \brief SERCOM1 signal: PAD1 on PA19 mux B */
#define MUX_PA19B_SERCOM1_PAD1             1
#define PORT_PA19B_SERCOM1_PAD1    (1u << 19)
#define PIN_PA04C_SERCOM1_PAD2             4  /**< \brief SERCOM1 signal: PAD2 on PA04 mux C */
#define MUX_PA04C_SERCOM1_PAD2             2
#define PORT_PA04C_SERCOM1_PAD2    (1u <<  4)
#define PIN_PA16B_SERCOM1_PAD2            16  /**< \brief SERCOM1 signal: PAD2 on PA16 mux B */
#define MUX_PA16B_SERCOM1_PAD2             1
#define PORT_PA16B_SERCOM1_PAD2    (1u << 16)
#define PIN_PA05C_SERCOM1_PAD3             5  /**< \brief SERCOM1 signal: PAD3 on PA05 mux C */
#define MUX_PA05C_SERCOM1_PAD3             2
#define PORT_PA05C_SERCOM1_PAD3    (1u <<  5)
#define PIN_PA17B_SERCOM1_PAD3            17  /**< \brief SERCOM1 signal: PAD3 on PA17 mux B */
#define MUX_PA17B_SERCOM1_PAD3             1
#define PORT_PA17B_SERCOM1_PAD3    (1u << 17)
/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PA10C_SERCOM2_PAD0            10  /**< \brief SERCOM2 signal: PAD0 on PA10 mux C */
#define MUX_PA10C_SERCOM2_PAD0             2
#define PORT_PA10C_SERCOM2_PAD0    (1u << 10)
#define PIN_PA14B_SERCOM2_PAD0            14  /**< \brief SERCOM2 signal: PAD0 on PA14 mux B */
#define MUX_PA14B_SERCOM2_PAD0             1
#define PORT_PA14B_SERCOM2_PAD0    (1u << 14)
#define PIN_PA11C_SERCOM2_PAD1            11  /**< \brief SERCOM2 signal: PAD1 on PA11 mux C */
#define MUX_PA11C_SERCOM2_PAD1             2
#define PORT_PA11C_SERCOM2_PAD1    (1u << 11)
#define PIN_PA15B_SERCOM2_PAD1            15  /**< \brief SERCOM2 signal: PAD1 on PA15 mux B */
#define MUX_PA15B_SERCOM2_PAD1             1
#define PORT_PA15B_SERCOM2_PAD1    (1u << 15)
#define PIN_PA08C_SERCOM2_PAD2             8  /**< \brief SERCOM2 signal: PAD2 on PA08 mux C */
#define MUX_PA08C_SERCOM2_PAD2             2
#define PORT_PA08C_SERCOM2_PAD2    (1u <<  8)
#define PIN_PA12B_SERCOM2_PAD2            12  /**< \brief SERCOM2 signal: PAD2 on PA12 mux B */
#define MUX_PA12B_SERCOM2_PAD2             1
#define PORT_PA12B_SERCOM2_PAD2    (1u << 12)
#define PIN_PA09C_SERCOM2_PAD3             9  /**< \brief SERCOM2 signal: PAD3 on PA09 mux C */
#define MUX_PA09C_SERCOM2_PAD3             2
#define PORT_PA09C_SERCOM2_PAD3    (1u <<  9)
#define PIN_PA13B_SERCOM2_PAD3            13  /**< \brief SERCOM2 signal: PAD3 on PA13 mux B */
#define MUX_PA13B_SERCOM2_PAD3             1
#define PORT_PA13B_SERCOM2_PAD3    (1u << 13)
/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PA18C_SERCOM3_PAD0            18  /**< \brief SERCOM3 signal: PAD0 on PA18 mux C */
#define MUX_PA18C_SERCOM3_PAD0             2
#define PORT_PA18C_SERCOM3_PAD0    (1u << 18)
#define PIN_PA24B_SERCOM3_PAD0            24  /**< \brief SERCOM3 signal: PAD0 on PA24 mux B */
#define MUX_PA24B_SERCOM3_PAD0             1
#define PORT_PA24B_SERCOM3_PAD0    (1u << 24)
#define PIN_PA19C_SERCOM3_PAD1            19  /**< \brief SERCOM3 signal: PAD1 on PA19 mux C */
#define MUX_PA19C_SERCOM3_PAD1             2
#define PORT_PA19C_SERCOM3_PAD1    (1u << 19)
#define PIN_PA25B_SERCOM3_PAD1            25  /**< \brief SERCOM3 signal: PAD1 on PA25 mux B */
#define MUX_PA25B_SERCOM3_PAD1             1
#define PORT_PA25B_SERCOM3_PAD1    (1u << 25)
#define PIN_PA16C_SERCOM3_PAD2            16  /**< \brief SERCOM3 signal: PAD2 on PA16 mux C */
#define MUX_PA16C_SERCOM3_PAD2             2
#define PORT_PA16C_SERCOM3_PAD2    (1u << 16)
#define PIN_PA26B_SERCOM3_PAD2            26  /**< \brief SERCOM3 signal: PAD2 on PA26 mux B */
#define MUX_PA26B_SERCOM3_PAD2             1
#define PORT_PA26B_SERCOM3_PAD2    (1u << 26)
#define PIN_PA17C_SERCOM3_PAD3            17  /**< \brief SERCOM3 signal: PAD3 on PA17 mux C */
#define MUX_PA17C_SERCOM3_PAD3             2
#define PORT_PA17C_SERCOM3_PAD3    (1u << 17)
