zhengwang721/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20128g3.h
#define PIN_PA27B_SERCOM3_PAD3            27  /**< \brief SERCOM3 signal: PAD3 on PA27 mux B */
#define MUX_PA27B_SERCOM3_PAD3             1
#define PORT_PA27B_SERCOM3_PAD3    (1u << 27)
/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_PA14C_SERCOM4_PAD0            14  /**< \brief SERCOM4 signal: PAD0 on PA14 mux C */
#define MUX_PA14C_SERCOM4_PAD0             2
#define PORT_PA14C_SERCOM4_PAD0    (1u << 14)
#define PIN_PB00C_SERCOM4_PAD0            32  /**< \brief SERCOM4 signal: PAD0 on PB00 mux C */
#define MUX_PB00C_SERCOM4_PAD0             2
#define PORT_PB00C_SERCOM4_PAD0    (1u <<  0)
#define PIN_PB08B_SERCOM4_PAD0            40  /**< \brief SERCOM4 signal: PAD0 on PB08 mux B */
#define MUX_PB08B_SERCOM4_PAD0             1
#define PORT_PB08B_SERCOM4_PAD0    (1u <<  8)
#define PIN_PA15C_SERCOM4_PAD1            15  /**< \brief SERCOM4 signal: PAD1 on PA15 mux C */
#define MUX_PA15C_SERCOM4_PAD1             2
#define PORT_PA15C_SERCOM4_PAD1    (1u << 15)
#define PIN_PB01C_SERCOM4_PAD1            33  /**< \brief SERCOM4 signal: PAD1 on PB01 mux C */
#define MUX_PB01C_SERCOM4_PAD1             2
#define PORT_PB01C_SERCOM4_PAD1    (1u <<  1)
#define PIN_PB09B_SERCOM4_PAD1            41  /**< \brief SERCOM4 signal: PAD1 on PB09 mux B */
#define MUX_PB09B_SERCOM4_PAD1             1
#define PORT_PB09B_SERCOM4_PAD1    (1u <<  9)
#define PIN_PB02C_SERCOM4_PAD2            34  /**< \brief SERCOM4 signal: PAD2 on PB02 mux C */
#define MUX_PB02C_SERCOM4_PAD2             2
#define PORT_PB02C_SERCOM4_PAD2    (1u <<  2)
#define PIN_PA12C_SERCOM4_PAD2            12  /**< \brief SERCOM4 signal: PAD2 on PA12 mux C */
#define MUX_PA12C_SERCOM4_PAD2             2
#define PORT_PA12C_SERCOM4_PAD2    (1u << 12)
#define PIN_PA13C_SERCOM4_PAD3            13  /**< \brief SERCOM4 signal: PAD3 on PA13 mux C */
#define MUX_PA13C_SERCOM4_PAD3             2
#define PORT_PA13C_SERCOM4_PAD3    (1u << 13)
#define PIN_PB03C_SERCOM4_PAD3            35  /**< \brief SERCOM4 signal: PAD3 on PB03 mux C */
#define MUX_PB03C_SERCOM4_PAD3             2
#define PORT_PB03C_SERCOM4_PAD3    (1u <<  3)
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PA24C_SERCOM5_PAD0            24  /**< \brief SERCOM5 signal: PAD0 on PA24 mux C */
#define MUX_PA24C_SERCOM5_PAD0             2
#define PORT_PA24C_SERCOM5_PAD0    (1u << 24)
#define PIN_PB20B_SERCOM5_PAD0            52  /**< \brief SERCOM5 signal: PAD0 on PB20 mux B */
#define MUX_PB20B_SERCOM5_PAD0             1
#define PORT_PB20B_SERCOM5_PAD0    (1u << 20)
#define PIN_PA25C_SERCOM5_PAD1            25  /**< \brief SERCOM5 signal: PAD1 on PA25 mux C */
#define MUX_PA25C_SERCOM5_PAD1             2
#define PORT_PA25C_SERCOM5_PAD1    (1u << 25)
#define PIN_PB21B_SERCOM5_PAD1            53  /**< \brief SERCOM5 signal: PAD1 on PB21 mux B */
#define MUX_PB21B_SERCOM5_PAD1             1
#define PORT_PB21B_SERCOM5_PAD1    (1u << 21)
#define PIN_PA26C_SERCOM5_PAD2            26  /**< \brief SERCOM5 signal: PAD2 on PA26 mux C */
#define MUX_PA26C_SERCOM5_PAD2             2
#define PORT_PA26C_SERCOM5_PAD2    (1u << 26)
#define PIN_PB22B_SERCOM5_PAD2            54  /**< \brief SERCOM5 signal: PAD2 on PB22 mux B */
#define MUX_PB22B_SERCOM5_PAD2             1
#define PORT_PB22B_SERCOM5_PAD2    (1u << 22)
#define PIN_PA27C_SERCOM5_PAD3            27  /**< \brief SERCOM5 signal: PAD3 on PA27 mux C */
#define MUX_PA27C_SERCOM5_PAD3             2
#define PORT_PA27C_SERCOM5_PAD3    (1u << 27)
#define PIN_PB23B_SERCOM5_PAD3            55  /**< \brief SERCOM5 signal: PAD3 on PB23 mux B */
#define MUX_PB23B_SERCOM5_PAD3             1
#define PORT_PB23B_SERCOM5_PAD3    (1u << 23)
/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_PA00D_TC0_WO0                  0  /**< \brief TC0 signal: WO0 on PA00 mux D */
#define MUX_PA00D_TC0_WO0                  3
#define PORT_PA00D_TC0_WO0         (1u <<  0)
#define PIN_PA08D_TC0_WO0                  8  /**< \brief TC0 signal: WO0 on PA08 mux D */
#define MUX_PA08D_TC0_WO0                  3
#define PORT_PA08D_TC0_WO0         (1u <<  8)
#define PIN_PA01D_TC0_WO1                  1  /**< \brief TC0 signal: WO1 on PA01 mux D */
#define MUX_PA01D_TC0_WO1                  3
#define PORT_PA01D_TC0_WO1         (1u <<  1)
#define PIN_PA09D_TC0_WO1                  9  /**< \brief TC0 signal: WO1 on PA09 mux D */
#define MUX_PA09D_TC0_WO1                  3
#define PORT_PA09D_TC0_WO1         (1u <<  9)
/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA04D_TC1_WO0                  4  /**< \brief TC1 signal: WO0 on PA04 mux D */
#define MUX_PA04D_TC1_WO0                  3
#define PORT_PA04D_TC1_WO0         (1u <<  4)
#define PIN_PA10D_TC1_WO0                 10  /**< \brief TC1 signal: WO0 on PA10 mux D */
#define MUX_PA10D_TC1_WO0                  3
#define PORT_PA10D_TC1_WO0         (1u << 10)
#define PIN_PA30D_TC1_WO0                 30  /**< \brief TC1 signal: WO0 on PA30 mux D */
#define MUX_PA30D_TC1_WO0                  3
#define PORT_PA30D_TC1_WO0         (1u << 30)
#define PIN_PA05D_TC1_WO1                  5  /**< \brief TC1 signal: WO1 on PA05 mux D */
#define MUX_PA05D_TC1_WO1                  3
#define PORT_PA05D_TC1_WO1         (1u <<  5)
#define PIN_PA11D_TC1_WO1                 11  /**< \brief TC1 signal: WO1 on PA11 mux D */
#define MUX_PA11D_TC1_WO1                  3
#define PORT_PA11D_TC1_WO1         (1u << 11)
#define PIN_PA31D_TC1_WO1                 31  /**< \brief TC1 signal: WO1 on PA31 mux D */
#define MUX_PA31D_TC1_WO1                  3
#define PORT_PA31D_TC1_WO1         (1u << 31)
/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_PA16D_TC2_WO0                 16  /**< \brief TC2 signal: WO0 on PA16 mux D */
#define MUX_PA16D_TC2_WO0                  3
#define PORT_PA16D_TC2_WO0         (1u << 16)
#define PIN_PA12D_TC2_WO0                 12  /**< \brief TC2 signal: WO0 on PA12 mux D */
#define MUX_PA12D_TC2_WO0                  3
#define PORT_PA12D_TC2_WO0         (1u << 12)
#define PIN_PA17D_TC2_WO1                 17  /**< \brief TC2 signal: WO1 on PA17 mux D */
#define MUX_PA17D_TC2_WO1                  3
#define PORT_PA17D_TC2_WO1         (1u << 17)
#define PIN_PA13D_TC2_WO1                 13  /**< \brief TC2 signal: WO1 on PA13 mux D */
#define MUX_PA13D_TC2_WO1                  3
#define PORT_PA13D_TC2_WO1         (1u << 13)
/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA14D_TC3_WO0                 14  /**< \brief TC3 signal: WO0 on PA14 mux D */
#define MUX_PA14D_TC3_WO0                  3
#define PORT_PA14D_TC3_WO0         (1u << 14)
#define PIN_PA18D_TC3_WO0                 18  /**< \brief TC3 signal: WO0 on PA18 mux D */
#define MUX_PA18D_TC3_WO0                  3
#define PORT_PA18D_TC3_WO0         (1u << 18)
#define PIN_PA15D_TC3_WO1                 15  /**< \brief TC3 signal: WO1 on PA15 mux D */
#define MUX_PA15D_TC3_WO1                  3
#define PORT_PA15D_TC3_WO1         (1u << 15)
#define PIN_PA19D_TC3_WO1                 19  /**< \brief TC3 signal: WO1 on PA19 mux D */
#define MUX_PA19D_TC3_WO1                  3
#define PORT_PA19D_TC3_WO1         (1u << 19)
/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PB08D_TC4_WO0                 40  /**< \brief TC4 signal: WO0 on PB08 mux D */
#define MUX_PB08D_TC4_WO0                  3
#define PORT_PB08D_TC4_WO0         (1u <<  8)
#define PIN_PA24D_TC4_WO0                 24  /**< \brief TC4 signal: WO0 on PA24 mux D */
#define MUX_PA24D_TC4_WO0                  3
#define PORT_PA24D_TC4_WO0         (1u << 24)
#define PIN_PB09D_TC4_WO1                 41  /**< \brief TC4 signal: WO1 on PB09 mux D */
#define MUX_PB09D_TC4_WO1                  3
#define PORT_PB09D_TC4_WO1         (1u <<  9)
#define PIN_PA25D_TC4_WO1                 25  /**< \brief TC4 signal: WO1 on PA25 mux D */
#define MUX_PA25D_TC4_WO1                  3
#define PORT_PA25D_TC4_WO1         (1u << 25)
/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PA26D_TC5_WO0                 26  /**< \brief TC5 signal: WO0 on PA26 mux D */
#define MUX_PA26D_TC5_WO0                  3
#define PORT_PA26D_TC5_WO0         (1u << 26)
#define PIN_PB00D_TC5_WO0                 32  /**< \brief TC5 signal: WO0 on PB00 mux D */
#define MUX_PB00D_TC5_WO0                  3
#define PORT_PB00D_TC5_WO0         (1u <<  0)
#define PIN_PA27D_TC5_WO1                 27  /**< \brief TC5 signal: WO1 on PA27 mux D */
#define MUX_PA27D_TC5_WO1                  3
#define PORT_PA27D_TC5_WO1         (1u << 27)
#define PIN_PB01D_TC5_WO1                 33  /**< \brief TC5 signal: WO1 on PB01 mux D */
#define MUX_PB01D_TC5_WO1                  3
#define PORT_PB01D_TC5_WO1         (1u <<  1)
/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PB20D_TC6_WO0                 52  /**< \brief TC6 signal: WO0 on PB20 mux D */
#define MUX_PB20D_TC6_WO0                  3
#define PORT_PB20D_TC6_WO0         (1u << 20)
#define PIN_PB21D_TC6_WO1                 53  /**< \brief TC6 signal: WO1 on PB21 mux D */
#define MUX_PB21D_TC6_WO1                  3
#define PORT_PB21D_TC6_WO1         (1u << 21)
/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PB22D_TC7_WO0                 54  /**< \brief TC7 signal: WO0 on PB22 mux D */
#define MUX_PB22D_TC7_WO0                  3
#define PORT_PB22D_TC7_WO0         (1u << 22)
#define PIN_PB23D_TC7_WO1                 55  /**< \brief TC7 signal: WO1 on PB23 mux D */
#define MUX_PB23D_TC7_WO1                  3
#define PORT_PB23D_TC7_WO1         (1u << 23)
/* ========== PORT definition for ADC peripheral ========== */
#define PIN_PA00H_ADC_AIN0                 0  /**< \brief ADC signal: AIN0 on PA00 mux H */
#define MUX_PA00H_ADC_AIN0                 7
#define PORT_PA00H_ADC_AIN0        (1u <<  0)
#define PIN_PA01H_ADC_AIN1                 1  /**< \brief ADC signal: AIN1 on PA01 mux H */
#define MUX_PA01H_ADC_AIN1                 7
#define PORT_PA01H_ADC_AIN1        (1u <<  1)
#define PIN_PA02H_ADC_AIN2                 2  /**< \brief ADC signal: AIN2 on PA02 mux H */
#define MUX_PA02H_ADC_AIN2                 7
#define PORT_PA02H_ADC_AIN2        (1u <<  2)
#define PIN_PA03H_ADC_AIN3                 3  /**< \brief ADC signal: AIN3 on PA03 mux H */
#define MUX_PA03H_ADC_AIN3                 7
#define PORT_PA03H_ADC_AIN3        (1u <<  3)
#define PIN_PA04H_ADC_AIN4                 4  /**< \brief ADC signal: AIN4 on PA04 mux H */
#define MUX_PA04H_ADC_AIN4                 7
#define PORT_PA04H_ADC_AIN4        (1u <<  4)
#define PIN_PA05H_ADC_AIN5                 5  /**< \brief ADC signal: AIN5 on PA05 mux H */
#define MUX_PA05H_ADC_AIN5                 7
#define PORT_PA05H_ADC_AIN5        (1u <<  5)
#define PIN_PA06H_ADC_AIN6                 6  /**< \brief ADC signal: AIN6 on PA06 mux H */
#define MUX_PA06H_ADC_AIN6                 7
#define PORT_PA06H_ADC_AIN6        (1u <<  6)
#define PIN_PA07H_ADC_AIN7                 7  /**< \brief ADC signal: AIN7 on PA07 mux H */
#define MUX_PA07H_ADC_AIN7                 7
#define PORT_PA07H_ADC_AIN7        (1u <<  7)
#define PIN_PB00H_ADC_AIN8                32  /**< \brief ADC signal: AIN8 on PB00 mux H */
#define MUX_PB00H_ADC_AIN8                 7
#define PORT_PB00H_ADC_AIN8        (1u <<  0)
#define PIN_PB01H_ADC_AIN9                33  /**< \brief ADC signal: AIN9 on PB01 mux H */
#define MUX_PB01H_ADC_AIN9                 7
#define PORT_PB01H_ADC_AIN9        (1u <<  1)
#define PIN_PB02H_ADC_AIN10               34  /**< \brief ADC signal: AIN10 on PB02 mux H */
#define MUX_PB02H_ADC_AIN10                7
#define PORT_PB02H_ADC_AIN10       (1u <<  2)
#define PIN_PB03H_ADC_AIN11               35  /**< \brief ADC signal: AIN11 on PB03 mux H */
#define MUX_PB03H_ADC_AIN11                7
#define PORT_PB03H_ADC_AIN11       (1u <<  3)
#define PIN_PA02H_ADC_VREFP                2  /**< \brief ADC signal: VREFP on PA02 mux H */
#define MUX_PA02H_ADC_VREFP                7
#define PORT_PA02H_ADC_VREFP       (1u <<  2)
/* ========== PORT definition for AC peripheral ========== */
#define PIN_PA04H_AC_AIN0                  4  /**< \brief AC signal: AIN0 on PA04 mux H */
#define MUX_PA04H_AC_AIN0                  7
#define PORT_PA04H_AC_AIN0         (1u <<  4)
#define PIN_PA05H_AC_AIN1                  5  /**< \brief AC signal: AIN1 on PA05 mux H */
#define MUX_PA05H_AC_AIN1                  7
#define PORT_PA05H_AC_AIN1         (1u <<  5)
#define PIN_PA06H_AC_AIN2                  6  /**< \brief AC signal: AIN2 on PA06 mux H */
#define MUX_PA06H_AC_AIN2                  7
#define PORT_PA06H_AC_AIN2         (1u <<  6)
#define PIN_PA07H_AC_AIN3                  7  /**< \brief AC signal: AIN3 on PA07 mux H */
#define MUX_PA07H_AC_AIN3                  7
#define PORT_PA07H_AC_AIN3         (1u <<  7)
#define PIN_PA10G_AC_CMP0                 10  /**< \brief AC signal: CMP0 on PA10 mux G */
#define MUX_PA10G_AC_CMP0                  6
#define PORT_PA10G_AC_CMP0         (1u << 10)
#define PIN_PA12G_AC_CMP0                 12  /**< \brief AC signal: CMP0 on PA12 mux G */
#define MUX_PA12G_AC_CMP0                  6
#define PORT_PA12G_AC_CMP0         (1u << 12)
#define PIN_PA11G_AC_CMP1                 11  /**< \brief AC signal: CMP1 on PA11 mux G */
#define MUX_PA11G_AC_CMP1                  6
#define PORT_PA11G_AC_CMP1         (1u << 11)
#define PIN_PA13G_AC_CMP1                 13  /**< \brief AC signal: CMP1 on PA13 mux G */
#define MUX_PA13G_AC_CMP1                  6
#define PORT_PA13G_AC_CMP1         (1u << 13)
/* ========== PORT definition for DAC peripheral ========== */
#define PIN_PA00H_DAC_VOUT                 0  /**< \brief DAC signal: VOUT on PA00 mux H */
#define MUX_PA00H_DAC_VOUT                 7
#define PORT_PA00H_DAC_VOUT        (1u <<  0)
#define PIN_PA01H_DAC_VREFP                1  /**< \brief DAC signal: VREFP on PA01 mux H */
#define MUX_PA01H_DAC_VREFP                7
#define PORT_PA01H_DAC_VREFP       (1u <<  1)
/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PA10H_PTC_X0                  10  /**< \brief PTC signal: X0 on PA10 mux H */
#define MUX_PA10H_PTC_X0                   7
#define PORT_PA10H_PTC_X0          (1u << 10)
#define PIN_PA11H_PTC_X1                  11  /**< \brief PTC signal: X1 on PA11 mux H */
#define MUX_PA11H_PTC_X1                   7
#define PORT_PA11H_PTC_X1          (1u << 11)
#define PIN_PA14H_PTC_X2                  14  /**< \brief PTC signal: X2 on PA14 mux H */
#define MUX_PA14H_PTC_X2                   7
#define PORT_PA14H_PTC_X2          (1u << 14)
#define PIN_PA15H_PTC_X3                  15  /**< \brief PTC signal: X3 on PA15 mux H */
#define MUX_PA15H_PTC_X3                   7
#define PORT_PA15H_PTC_X3          (1u << 15)
#define PIN_PA16H_PTC_X4                  16  /**< \brief PTC signal: X4 on PA16 mux H */
#define MUX_PA16H_PTC_X4                   7
#define PORT_PA16H_PTC_X4          (1u << 16)
#define PIN_PA17H_PTC_X5                  17  /**< \brief PTC signal: X5 on PA17 mux H */
#define MUX_PA17H_PTC_X5                   7
#define PORT_PA17H_PTC_X5          (1u << 17)
#define PIN_PA18H_PTC_X6                  18  /**< \brief PTC signal: X6 on PA18 mux H */
#define MUX_PA18H_PTC_X6                   7
#define PORT_PA18H_PTC_X6          (1u << 18)
#define PIN_PA19H_PTC_X7                  19  /**< \brief PTC signal: X7 on PA19 mux H */
#define MUX_PA19H_PTC_X7                   7
#define PORT_PA19H_PTC_X7          (1u << 19)
#define PIN_PB20H_PTC_X8                  52  /**< \brief PTC signal: X8 on PB20 mux H */
#define MUX_PB20H_PTC_X8                   7
#define PORT_PB20H_PTC_X8          (1u << 20)
#define PIN_PB21H_PTC_X9                  53  /**< \brief PTC signal: X9 on PB21 mux H */
#define MUX_PB21H_PTC_X9                   7
#define PORT_PB21H_PTC_X9          (1u << 21)
#define PIN_PB22H_PTC_X10                 54  /**< \brief PTC signal: X10 on PB22 mux H */
#define MUX_PB22H_PTC_X10                  7
#define PORT_PB22H_PTC_X10         (1u << 22)
#define PIN_PB23H_PTC_X11                 55  /**< \brief PTC signal: X11 on PB23 mux H */
#define MUX_PB23H_PTC_X11                  7
#define PORT_PB23H_PTC_X11         (1u << 23)
#define PIN_PA00H_PTC_Y0                   0  /**< \brief PTC signal: Y0 on PA00 mux H */
#define MUX_PA00H_PTC_Y0                   7
#define PORT_PA00H_PTC_Y0          (1u <<  0)
#define PIN_PA01H_PTC_Y1                   1  /**< \brief PTC signal: Y1 on PA01 mux H */
#define MUX_PA01H_PTC_Y1                   7
#define PORT_PA01H_PTC_Y1          (1u <<  1)
#define PIN_PA02H_PTC_Y2                   2  /**< \brief PTC signal: Y2 on PA02 mux H */
#define MUX_PA02H_PTC_Y2                   7
#define PORT_PA02H_PTC_Y2          (1u <<  2)
#define PIN_PA03H_PTC_Y3                   3  /**< \brief PTC signal: Y3 on PA03 mux H */
#define MUX_PA03H_PTC_Y3                   7
#define PORT_PA03H_PTC_Y3          (1u <<  3)
#define PIN_PA04H_PTC_Y4                   4  /**< \brief PTC signal: Y4 on PA04 mux H */
#define MUX_PA04H_PTC_Y4                   7
#define PORT_PA04H_PTC_Y4          (1u <<  4)
#define PIN_PA05H_PTC_Y5                   5  /**< \brief PTC signal: Y5 on PA05 mux H */
#define MUX_PA05H_PTC_Y5                   7
#define PORT_PA05H_PTC_Y5          (1u <<  5)
#define PIN_PA06H_PTC_Y6                   6  /**< \brief PTC signal: Y6 on PA06 mux H */
#define MUX_PA06H_PTC_Y6                   7
#define PORT_PA06H_PTC_Y6          (1u <<  6)
#define PIN_PA07H_PTC_Y7                   7  /**< \brief PTC signal: Y7 on PA07 mux H */
#define MUX_PA07H_PTC_Y7                   7
#define PORT_PA07H_PTC_Y7          (1u <<  7)
#define PIN_PB00H_PTC_Y8                  32  /**< \brief PTC signal: Y8 on PB00 mux H */
#define MUX_PB00H_PTC_Y8                   7
#define PORT_PB00H_PTC_Y8          (1u <<  0)
#define PIN_PB01H_PTC_Y9                  33  /**< \brief PTC signal: Y9 on PB01 mux H */
#define MUX_PB01H_PTC_Y9                   7
#define PORT_PB01H_PTC_Y9          (1u <<  1)
#define PIN_PB02H_PTC_Y10                 34  /**< \brief PTC signal: Y10 on PB02 mux H */
#define MUX_PB02H_PTC_Y10                  7
#define PORT_PB02H_PTC_Y10         (1u <<  2)
#define PIN_PB03H_PTC_Y11                 35  /**< \brief PTC signal: Y11 on PB03 mux H */
#define MUX_PB03H_PTC_Y11                  7
#define PORT_PB03H_PTC_Y11         (1u <<  3)

#endif /* _SAMD20128G3_PIO_ */
